<a href="https://colab.research.google.com/github/Shreyabansal3112/testing/blob/main/test1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data={'Sno':[1,2,3,4,5,6]}

In [ ]:
df=pd.DataFrame(data,columns=['Sno'])

In [ ]:
df.head()

   Sno
0    1
1    2
2    3
3    4
4    5

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sno     6 non-null      int64
dtypes: int64(1)
memory usage: 176.0 bytes

In [ ]:
import numpy as np
df['test']=(df['Sno']==2).astype(np.int8)

In [ ]:
df

   Sno  test
0    1     0
1    2     1
2    3     0
3    4     0
4    5     0
5    6     0

In [ ]:
df['test1']=(df['Sno']==4).astype(np.int8)

In [ ]:
df

   Sno  test  test1
0    1     0      0
1    2     1      0
2    3     0      0
3    4     0      1
4    5     0      0
5    6     0      0